jevinskie/plocate-xnu/plocate-build.8
.TH plocate-build 8 "Oct 2020" plocate-build
.SH NAME
plocate-build \- generate index for plocate

.SH SYNOPSIS
.B plocate-build
.I "[OPTION]..."
.I "MLOCATE_DB"
.I "PLOCATE_DB"

.SH DESCRIPTION
.B plocate-build
creates an index from 
.BR plocate (1)
from an index earlier generated by
.BR updatedb (1)
from the
.BR mlocate (1)
package. This is currently the only way to build such an index.
If
.I PLOCATE_DB
already exists, it will be overwritten (non-atomically). The file is
created such that it is not world-readable, as the final access check
is done by
.BR plocate (1)
during the search.

.SH OPTIONS
.TP
\fB\-b\fR, \fB\-\-block\-size\fR \fISIZE\fR
Create blocks containing
.I SIZE
filenames each, compress them together, and treat them as the same element
in the posting lists. This makes the index smaller (because the compression
algorithm gets more context to work with, and because there are fewer elements
in each posting list), but also makes posting lists less precise, moving more
work to weeding out false positives after posting list intersection.

Making this number larger will make linear search (for \fB\-\-regex\fR,
or very short patterns) faster, with diminishing returns around 256 filenames
per block. However, making it too large will cause more false positives,
reducing overall performance for typical queries. The default value is 32.
Setting it to 1 makes one (compressed) block per filename.

.TP
\fB\-p\fR, \fB\-\-plaintext\fR
Treat the input as plain text, with entries delimited by newlines,
instead of an mlocate database.

.TP
.B \-\-help
Print out usage information, then exit successfully.

.TP
.B \-\-version
Print out version information, then exit successfully.

.SH AUTHOR
Steinar H. Gunderson <steinar+plocate@gunderson.no>

.SH SEE ALSO
\fBplocate\fP(1),
\fB/etc/cron.daily/plocate\fR (which is called
\fBupdate-plocate.sh\fR in the source distribution)
